app/controllers/sentences_controller.rb

  def index
    @sentences = Sentence.all
---
SELECT "sentences".* FROM "sentences"

    def set_sentence
      @sentence = Sentence.find(params[:id])
---
SELECT "sentences".* FROM "sentences" WHERE "sentences"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]